app/Controllers/Dashboard.php

    public function index()
    {
        // Cek login
        if (!session()->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }

        $produkModel = new ProdukModel();
        $transaksiModel = new TransaksiModel();

        // admin
        if (session()->get('role') === 'admin') {
            $jumlahProduk = $produkModel->countAllResults();

            // Total produk terjual (hanya transaksi keluar)
            $totalProdukTerjual = $transaksiModel
                ->where('jenis_transaksi', 'keluar')
                ->selectSum('jumlah')
                ->first()['jumlah'] ?? 0;

            // Total pendapatan (hanya transaksi keluar)
            $totalPendapatan = $transaksiModel
                ->where('jenis_transaksi', 'keluar')
                ->selectSum('total_harga')
                ->first()['total_harga'] ?? 0;

            // Riwayat transaksi
            $transaksi = $transaksiModel
                ->select('transaksi.*, produk.nama_produk')
                ->join('produk', 'produk.id = transaksi.produk_id')
                ->orderBy('transaksi.id', 'DESC')
                ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `produk`
SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaksi`
WHERE `jenis_transaksi` = 'keluar'
 LIMIT 1
SELECT SUM(`total_harga`) AS `total_harga`
FROM `transaksi`
WHERE `jenis_transaksi` = 'keluar'
 LIMIT 1
SELECT `transaksi`.*, `produk`.`nama_produk`
FROM `transaksi`
JOIN `produk` ON `produk`.`id` = `transaksi`.`produk_id`
ORDER BY `transaksi`.`id` DESC

        // User
        $data = [
            'produk'     => $produkModel->findAll(),
            'transaksi'  => $transaksiModel
                                ->select('transaksi.*, produk.nama_produk')
                                ->join('produk', 'produk.id = transaksi.produk_id')
                                ->orderBy('transaksi.id', 'DESC')
                                ->findAll()
---
SELECT `transaksi`.*, `produk`.`nama_produk`
FROM `transaksi`
JOIN `produk` ON `produk`.`id` = `transaksi`.`produk_id`
ORDER BY `transaksi`.`id` DESC