app/Controllers/ProdukController.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $model = new ProdukModel();
        $data['produk'] = $model->findAll();