app/Controllers/TransaksiController.php

SELECT *
FROM `produk`
SELECT `transaksi`.*, `produk`.`nama_produk`
FROM `transaksi`
JOIN `produk` ON `produk`.`id` = `transaksi`.`produk_id`
ORDER BY `transaksi`.`created_at` DESC
---
    public function index()
    {
        $produkModel = new ProdukModel();
        $transaksiModel = new TransaksiModel();

        $data['produk'] = $produkModel->findAll();
        $data['transaksi'] = $transaksiModel
            ->select('transaksi.*, produk.nama_produk')
            ->join('produk', 'produk.id = transaksi.produk_id')
            ->orderBy('transaksi.created_at', 'DESC')
            ->findAll();

SELECT *
FROM `produk`
WHERE `produk`.`id` = '16'
---
    public function saveUser()
    {
        $produkModel = new ProdukModel();
        $transaksiModel = new TransaksiModel();

        $ids = $this->request->getPost('id');
        $produk_ids = $this->request->getPost('produk_id');
        $jumlahs = $this->request->getPost('jumlah');

        if (!is_array($produk_ids)) {
            $produk_ids = [$produk_ids];
            $jumlahs = [$jumlahs];
            $ids = [$ids];
        }

        $responses = [];
        foreach ($produk_ids as $index => $produk_id) {
            $id = $ids[$index] ?? null;
            $jumlah = (int)($jumlahs[$index] ?? 0);

            $produkBaru = $produkModel->find($produk_id);

SELECT *
FROM `produk`
WHERE `produk`.`id` = '16'
UPDATE `produk` SET `sisa_stok` = 30, `updated_at` = '2025-12-04 20:12:33'
WHERE `produk`.`id` IN ('16')
---
                ]);
            }

            $produkModel->update($produk_id, [
                'sisa_stok' => $produkModel->find($produk_id)['sisa_stok'] - $jumlah
            ]);

INSERT INTO `transaksi` (`produk_id`, `jumlah`, `jenis_transaksi`, `total_harga`, `created_at`, `updated_at`) VALUES ('16', 2, 'keluar', 20000, '2025-12-04 20:12:33', '2025-12-04 20:12:33')
---
                $transaksiModel->update($id, $data);
                $responses[] = ['status' => 'updated', 'produk' => $produkBaru['nama_produk']];
            } else {
                $transaksiModel->insert($data);